7767517
17 18
Input DarknetNet_0 0 1 DarknetNet_0_out 0=28 1=28 2=3
Convolution convolutional_0 1 1 DarknetNet_0_out convolutional_0_out 0=8 1=3 2=1 3=1 4=1 5=0 6=216
BatchNorm convolutional_0_batch_normalize 1 1 convolutional_0_out convolutional_0_batch_normalize_out 0=8
ReLU convolutional_0_activation 1 1 convolutional_0_batch_normalize_out convolutional_0_activation_out 0=0.1
Pooling maxpool_0 1 1 convolutional_0_activation_out maxpool_0_out 0=0 1=2 2=2 3=0 4=0
Convolution convolutional_1 1 1 maxpool_0_out convolutional_1_out 0=16 1=3 2=1 3=1 4=1 5=0 6=1152
BatchNorm convolutional_1_batch_normalize 1 1 convolutional_1_out convolutional_1_batch_normalize_out 0=16
ReLU convolutional_1_activation 1 1 convolutional_1_batch_normalize_out convolutional_1_activation_out 0=0.1
Pooling maxpool_1 1 1 convolutional_1_activation_out maxpool_1_out 0=0 1=2 2=2 3=0 4=0
Convolution convolutional_2 1 1 maxpool_1_out convolutional_2_out 0=32 1=3 2=1 3=1 4=1 5=0 6=4608
BatchNorm convolutional_2_batch_normalize 1 1 convolutional_2_out convolutional_2_batch_normalize_out 0=32
ReLU convolutional_2_activation 1 1 convolutional_2_batch_normalize_out convolutional_2_activation_out 0=0.1
Convolution convolutional_3 1 1 convolutional_2_activation_out convolutional_3_out 0=2 1=1 2=1 3=1 4=0 5=0 6=64
Bias convolutional_3_bias 1 1 convolutional_3_out convolutional_3_bias_out 0=2
ReLU convolutional_3_activation 1 1 convolutional_3_bias_out convolutional_3_activation_out 0=0.1
Pooling avgpool_0 1 1 convolutional_3_activation_out avgpool_0_out 0=1 1=1 2=1 3=0 4=1
Softmax Softmax_0 1 1 avgpool_0_out Softmax_0_out 0=0
